Revit 2024 API
Wall.WallType Property
 Retrieves or changes the type of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WallType WallType { get; set; }
Visual Basic
Public Property WallType As WallType
	Get
	Set
Visual C++
public:
property WallType^ WallType {
	WallType^ get ();
	void set (WallType^ value);
}
Field Value
 The type of the wall.
Remarks
 The WallType property can be used to retrieve the kind of the wall. This property can also be used to change the type of a wall by setting it to a different wall type. All the wall types in the project can be found using the Document.WallTypes property.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The wall type wallType is not valid for the current wall.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Wall Class
Autodesk.Revit.DB Namespace